돌의내구도 = [1, 2, 1, 4]

독 = [{
    "이름" : "루비독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "4",
    },{
    "이름" : "피치독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "3",
    },{
    "이름" : "씨-독",
    "나이" : "72년생",
    "점프력" : "2",
    "몸무게" : "1",
    },{
    "이름" : "코볼독",
    "나이" : "59년생",
    "점프력" : "1",
    "몸무게" : "1",
    }]

def 징검다리를건너라(돌의내구도, 독):
    answer = [ 독[i]['이름'] for i in range(len(독))]
    return answer

# def 징검다리를건너라(돌의내구도, 독):
#    answer = [i['이름'] for i in 독]
#    return answer

print(징검다리를건너라(돌의내구도, 독))
